# [pandas Exercises for Data Analysis](https://github.com/ajcr/100-pandas-puzzles/blob/master/100-pandas-puzzles.ipynb)

## Importing pandas

### Getting started and checking your pandas setup

**1.** Import pandas under the name `pd`.

In [1]:
import pandas as pd

**2.** Print the version of pandas that has been imported.

In [2]:
pd.__version__

'0.22.0'

**3.** Print out all the version info of the libraries that are required by the pandas library.

In [3]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit: None
python: 3.6.4.final.0
python-bits: 64
OS: Windows
OS-release: 10
machine: AMD64
processor: Intel64 Family 6 Model 94 Stepping 3, GenuineIntel
byteorder: little
LC_ALL: None
LANG: None
LOCALE: None.None

pandas: 0.22.0
pytest: 3.4.2
pip: 9.0.3
setuptools: 38.5.1
Cython: 0.27.3
numpy: 1.14.2
scipy: 1.0.0
pyarrow: None
xarray: None
IPython: 6.2.1
sphinx: 1.7.1
patsy: 0.5.0
dateutil: 2.7.0
pytz: 2018.3
blosc: None
bottleneck: 1.2.1
tables: 3.4.2
numexpr: 2.6.4
feather: None
matplotlib: 2.2.2
openpyxl: 2.5.1
xlrd: 1.1.0
xlwt: 1.3.0
xlsxwriter: 1.0.2
lxml: 4.2.0
bs4: 4.6.0
html5lib: 1.0.1
sqlalchemy: 1.2.5
pymysql: None
psycopg2: None
jinja2: 2.10
s3fs: None
fastparquet: None
pandas_gbq: None
pandas_datareader: 0.6.0

## DataFrame Basics
### A few of the fundamental routines for selecting, sorting, adding and aggregating data in DataFrame

In [4]:
import numpy as np

Consider the following Python dictionary `data` and Python list`labels`:

In [5]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, .5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

In [6]:
labels = list('abcdefghij')

> This is just some meaningless data.

**4.** Create a DataFrame `df` from this dictionary `data` which has the index `labels`.

In [7]:
df = pd.DataFrame(data, index=labels)

In [8]:
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  2.0    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

**5.** Display a summary of the basic info about this DataFrame and its data.

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
age         8 non-null float64
animal      10 non-null object
priority    10 non-null object
visits      10 non-null int64
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [10]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

**6.** Return the first 3 rows of the DataFrame df.

In [11]:
df.head(3)

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2

In [16]:
df.iloc[:3]

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2

**7.** Select just the *animal* and *age* columns from the DataFrame `df`.

In [17]:
df[['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [18]:
df.loc[:, ['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

**8.** Select the data in rows [3, 4, 8] and in columns ['animal', 'age'].

In [23]:
df.iloc[[3, 4, 8]][['animal', 'age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [24]:
df.loc[df.index[[3, 4, 8]], ['animal', 'age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

**9.** Select only the rows where the number of visits is greater than 2(原文是3，结果为空，避免引起误会，改成2)

In [27]:
df[df['visits'] > 2]

   age animal priority  visits
b  3.0    cat      yes       3
d  NaN    dog      yes       3
f  2.0    cat       no       3

**10.** Select the rows where the age is missing, i.e. is NaN.

In [30]:
df[df['age'].isnull()]

   age animal priority  visits
d  NaN    dog      yes       3
h  NaN    cat      yes       1

**11.** Select the rows where the animal is a cat and the age is less than 3.

In [35]:
df[(df.animal == 'cat') & (df.age < 3)]

   age animal priority  visits
a  2.5    cat      yes       1
f  2.0    cat       no       3

In [36]:
df.loc[df.animal == 'cat'][df.age < 3]

C:\Users\libin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

   age animal priority  visits
a  2.5    cat      yes       1
f  2.0    cat       no       3

**12.** Select the rows the age is between 2 and 4(inclusive).`

In [38]:
df[(df.age >=2) & (df.age <= 4)]

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
f  2.0    cat       no       3
j  3.0    dog       no       1

In [39]:
df[df.age.between(2, 4)]

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
f  2.0    cat       no       3
j  3.0    dog       no       1

> Series.between(self, left, right, inclusive=True)
&emsp;&emsp;Return boolean Series equivalent to left <= Series <= right. NA values will be treated as False.

**13.** Change the age in row 'f' to 1.5.

In [46]:
df.loc['f', 'age'] = 1.5

In [47]:
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  1.5    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

**14.** Calculate the sum of all visits(the total number of visits).

In [48]:
df.visits.sum()

19

In [49]:
df['visits'].sum()

19

**15.** Calculate the mean age of each different animal in `df`.

In [52]:
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

In [53]:
df.groupby('animal').mean()

             age  visits
animal
cat     2.333333     2.0
dog     5.000000     2.0
snake   2.500000     1.5

**16.** Append a new row 'k' to `df` with your choice of values for each column. Then delete that row to return the original DataFrame.

In [60]:
df.loc['k'] = [2.4, 'cat', 'yes', 5]
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  1.5    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1
k  2.4    cat      yes       5

In [62]:
df.drop('k')

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  1.5    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

**17.** Count the number of each type of animal in `df`.

In [63]:
df['animal'].value_counts()

cat      5
dog      4
snake    2
Name: animal, dtype: int64

**18.** Sort `df` first by the values in the 'age' in decending order, then by the value in the 'visit' column in ascending order.

In [66]:
df.sort_values(by=['age', 'visits'], ascending=[False, True])

   age animal priority  visits
i  7.0    dog       no       2
e  5.0    dog       no       2
g  4.5  snake       no       1
j  3.0    dog       no       1
b  3.0    cat      yes       3
a  2.5    cat      yes       1
k  2.4    cat      yes       5
f  1.5    cat       no       3
c  0.5  snake       no       2
h  NaN    cat      yes       1
d  NaN    dog      yes       3

** 19.** The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be True and 'no' should be False.

In [68]:
df['priority'] = df['priority'].map({'yes': True, 'no': False})

In [69]:
df

   age animal  priority  visits
a  2.5    cat      True       1
b  3.0    cat      True       3
c  0.5  snake     False       2
d  NaN    dog      True       3
e  5.0    dog     False       2
f  1.5    cat     False       3
g  4.5  snake     False       1
h  NaN    cat      True       1
i  7.0    dog     False       2
j  3.0    dog     False       1
k  2.4    cat      True       5

**20.** In the 'animal' column, change the 'snake' entries to 'Python'.

In [80]:
df = pd.DataFrame(data, index=labels)
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  2.0    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

In [81]:
animal = df['animal']
animal[animal == 'snake'] = 'Python'
df

C:\Users\libin\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

   age  animal priority  visits
a  2.5     cat      yes       1
b  3.0     cat      yes       3
c  0.5  Python       no       2
d  NaN     dog      yes       3
e  5.0     dog       no       2
f  2.0     cat       no       3
g  4.5  Python       no       1
h  NaN     cat      yes       1
i  7.0     dog       no       2
j  3.0     dog       no       1

In [82]:
df = pd.DataFrame(data, index=labels)

In [83]:
df['animal'] = df['animal'].replace('snake', 'Python')

In [84]:
df

   age  animal priority  visits
a  2.5     cat      yes       1
b  3.0     cat      yes       3
c  0.5  Python       no       2
d  NaN     dog      yes       3
e  5.0     dog       no       2
f  2.0     cat       no       3
g  4.5  Python       no       1
h  NaN     cat      yes       1
i  7.0     dog       no       2
j  3.0     dog       no       1

**21.** For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visists and the values are the mean ages(hint: use a pivot table).

In [85]:
df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')

visits    1    2    3
animal
Python  4.5  0.5  NaN
cat     2.5  NaN  2.5
dog     3.0  6.0  NaN

## DataFrame: beyond the basics

### Slightly tricker: u may need to combine two or more methods to get the right answer

The previous section was tour through some basic but essential DataFrame operations. Below are some ways that u might need to cut your data, but for which there is no single "out of the box" method.

**22.** You have a DataFrame `df` with a column 'A' of integers. For example:

`df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})`

How do u filter out rows which contain the same integers as the row immediately above?

In [87]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

In [88]:
df.loc[df['A'].shift() != df['A']]

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [92]:
df['A'].shift()

0     NaN
1     1.0
2     2.0
3     2.0
4     3.0
5     4.0
6     5.0
7     5.0
8     5.0
9     6.0
10    7.0
Name: A, dtype: float64

> 行索引为非时间序列，则行行索引保持不变，列索引发生移动

**23.** Given a DataFrame of numeric values, say

`df = pd.DataFrame(np.random.random(size=(5, 3)))`

how do u substract the row mean from each element in the row?

In [93]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.625304  0.803997  0.860698
1  0.470943  0.789746  0.562780
2  0.817590  0.168694  0.337120
3  0.283249  0.805877  0.535694
4  0.311669  0.157595  0.618328

In [96]:
df.mean(axis=1)

0    0.763333
1    0.607823
2    0.441135
3    0.541607
4    0.362531
dtype: float64

In [97]:
df.sub(df.mean(axis=1))

          0         1         2   3   4
0 -0.138029  0.196174  0.419563 NaN NaN
1 -0.292390  0.181923  0.121645 NaN NaN
2  0.054257 -0.439129 -0.104014 NaN NaN
3 -0.480084  0.198054  0.094559 NaN NaN
4 -0.451664 -0.450228  0.177194 NaN NaN

In [98]:
df.sub(df.mean(axis=1), axis=0)

          0         1         2
0 -0.138029  0.040664  0.097365
1 -0.136880  0.181923 -0.045043
2  0.376455 -0.272441 -0.104014
3 -0.258357  0.264270 -0.005913
4 -0.050862 -0.204936  0.255798

**24.** Suppose u have DataFrame with 10 columns of real numbers, for example:

`df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))`

Which column of numbers has the smallest sum?(Find that columns.label)

In [99]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df

,a,b,c,d,e,f,g,h,i,j
0,0.257132,0.798346,0.714598,0.799953,0.323650,0.802632,0.352222,0.954055,0.735765,0.486318
1,0.693980,0.183659,0.624649,0.793163,0.678265,0.169179,0.811342,0.285428,0.804812,0.362357
2,0.593518,0.128540,0.427712,0.226500,0.928858,0.978427,0.929389,0.360858,0.761822,0.015589
3,0.150032,0.258539,0.614974,0.501956,0.533720,0.388579,0.495498,0.488471,0.798881,0.989627
4,0.179296,0.561418,0.922736,0.791051,0.815686,0.274599,0.635632,0.388500,0.536746,0.920474

In [100]:
df.sum()

a    1.873958
b    1.930502
c    3.304670
d    3.112623
e    3.280179
f    2.613415
g    3.224083
h    2.477312
i    3.638026
j    2.774365
dtype: float64

In [101]:
df.sum().idxmin()

'a'

In [102]:
df.sum().argmin()

C:\Users\libin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: 'argmin' is deprecated. Use 'idxmin' instead. The behavior of 'argmin' will be corrected to return the positional minimum in the future. Use 'series.values.argmin' to get the position of the minimum now.
  """Entry point for launching an IPython kernel.

'a'

**25.** How do u count how many unique rows a DataFrame has(i.e. ignore all rows that are duplicates)?

```python
len(df.drop_duplicates(keep=False))

len(df) - df.duplicated(keep=False).sum()
```

&emsp;&emsp;P204

**26.** U have a DataFrame that consists of 10 columns of floating-point numbers. Suppose that exactly 5 entries in each row are NaN values. For each row of the DataFrame, find the column which contains the third NaN value.

U should return a Series of column labels.

In [103]:
df

,a,b,c,d,e,f,g,h,i,j
0,0.257132,0.798346,0.714598,0.799953,0.323650,0.802632,0.352222,0.954055,0.735765,0.486318
1,0.693980,0.183659,0.624649,0.793163,0.678265,0.169179,0.811342,0.285428,0.804812,0.362357
2,0.593518,0.128540,0.427712,0.226500,0.928858,0.978427,0.929389,0.360858,0.761822,0.015589
3,0.150032,0.258539,0.614974,0.501956,0.533720,0.388579,0.495498,0.488471,0.798881,0.989627
4,0.179296,0.561418,0.922736,0.791051,0.815686,0.274599,0.635632,0.388500,0.536746,0.920474

In [104]:
df.isnull()

       a      b      c      d      e      f      g      h      i      j
0  False  False  False  False  False  False  False  False  False  False
1  False  False  False  False  False  False  False  False  False  False
2  False  False  False  False  False  False  False  False  False  False
3  False  False  False  False  False  False  False  False  False  False
4  False  False  False  False  False  False  False  False  False  False

In [107]:
df.isnull().cumsum(axis=1)

   a  b  c  d  e  f  g  h  i  j
0  0  0  0  0  0  0  0  0  0  0
1  0  0  0  0  0  0  0  0  0  0
2  0  0  0  0  0  0  0  0  0  0
3  0  0  0  0  0  0  0  0  0  0
4  0  0  0  0  0  0  0  0  0  0

In [108]:
df.isnull().cumsum(axis=1).idxmax()

a    0
b    0
c    0
d    0
e    0
f    0
g    0
h    0
i    0
j    0
dtype: int64

本题答案
```python
(df.isnull().cumsum(axis=1) == 3).idxmax(axis=1)
```

**27.** A DataFrame has a column of group's 'grps' and column of numbers 'vals'. For example:

`df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'),
                   'vals': [12, 345, 3, 1, 45, 14, 4, 52, 54, 23, 235, 21, 57, 3, 87]})`

For each group, find the sum of the three greatest values.

In [110]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'),
                   'vals': [12, 345, 3, 1, 45, 14, 4, 52, 54, 23, 235, 21, 57, 3, 87]})
df

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a    52
8     b    54
9     c    23
10    c   235
11    c    21
12    b    57
13    b     3
14    c    87

In [111]:
df.groupby('grps')['vals'].nlargest(3)

grps
a     1     345
      7      52
      0      12
b     12     57
      8      54
      4      45
c     10    235
      14     87
      9      23
Name: vals, dtype: int64

In [112]:
df.groupby('grps')['vals'].nlargest(3).sum(level=0)

grps
a    409
b    156
c    345
Name: vals, dtype: int64

**28.** A DataFrame has two integer columns 'A' and 'B'. The values in "A" are between 0 and 100(inclusive). For each group of 10 consecutive integers in 'A'(i.e. (0, 10], (10, 20], ...), calculate the sum of the corresponding values in column 'B'.

```python
df.groupby(pd.cut(df['A'], np.arange(0, 101, 10)))['B'].sum()
```

In [113]:
df = pd.DataFrame(np.random.randint(0, 101, size=(10, 2)), columns=['A', 'B'])
df

    A   B
0  45  59
1  90  89
2  20  69
3   6  42
4  48  85
5  85  86
6  42  90
7  72  54
8  39  69
9  73  39

In [115]:
df.groupby(pd.cut(df['A'], np.arange(0, 101, 10)))['B'].sum()

A
(0, 10]       42
(10, 20]      69
(20, 30]       0
(30, 40]      69
(40, 50]     234
(50, 60]       0
(60, 70]       0
(70, 80]      93
(80, 90]     175
(90, 100]      0
Name: B, dtype: int32

In [117]:
pd.cut(df['A'], np.arange(0, 101, 10))

0    (40, 50]
1    (80, 90]
2    (10, 20]
3     (0, 10]
4    (40, 50]
5    (80, 90]
6    (40, 50]
7    (70, 80]
8    (30, 40]
9    (70, 80]
Name: A, dtype: category
Categories (10, interval[int64]): [(0, 10] < (10, 20] < (20, 30] < (30, 40] ... (60, 70] < (70, 80] < (80, 90] < (90, 100]]

## DataFrame: harder problems

### These might require a bit of thinking outside the box...

but all are solvable using just the usual pandas/NumPy methods(and so avoid using explict `for` loops).

**29.** Consider a DataFrame `df` where there is an integer column 'X':

`df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})`

For each value, count the difference back to the previous zero (or the start of the Series, whichever is closer). These values should therefore be [1, 2, 0, 1, 2, 3, 4, 0, 1, 2]. Make this a new column 'Y'.

In [118]:
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
df

   X
0  7
1  2
2  0
3  3
4  4
5  2
6  5
7  0
8  3
9  4

In [125]:
# indices of zeros
izero = np.r_[-1, (df['X'] == 0).nonzero()[0]]
izero

array([-1,  2,  7], dtype=int64)

In [126]:
(df['X'] == 0).nonzero()

(array([2, 7], dtype=int64),)

In [127]:
idx = np.arange(len(df))

In [128]:
idx

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [129]:
df["Y"] = idx - izero[np.searchsorted(izero - 1, idx) - 1]

In [130]:
df

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2